
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	рфДанныеСтроки = Параметры.ДанныеСтроки;
	рфТекст = рфДанныеСтроки.Значение;     
	Элементы.рфТекст.Заголовок = "Имя параметра: '" + рфДанныеСтроки.Имя + "'.";  
	
	Начало = рфДанныеСтроки.Имя +" = Неопределено;"; 
	Если НЕ СтрНачинаетсяС(Нрег(рфТекст),нрег(Начало)) тогда
		рфТекст = Начало+Символы.ПС+ рфТекст;               
	КонецЕсли;
	
	рфТекст = СтрЗаменить(рфТекст,Символ(182),Символы.ПС);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтаФорма.ОповеститьОВыборе(Новый Структура("Значение,ИдСтроки",рфТекст,Параметры.ИдСтроки)); 
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()     
	рфРезультат_Имитация = Неопределено;
	ДанныеПоПар = рфДанныеСтроки;
	ВыполняемыйТекст = ДанныеПоПар.Имя+"=Неопределено;
	|"+рфТекст+";
	|рфРезультат_Имитация = "+ДанныеПоПар.Имя;   
	Выполнить(ВыполняемыйТекст);
	Если ТипЗнч(рфРезультат_Имитация) = Тип("Массив") тогда
		рфРезультат = Новый СписокЗначений;
		рфРезультат.ЗагрузитьЗначения(рфРезультат_Имитация);	
	Иначе
		рфРезультат = рфРезультат_Имитация;
		Если ТипЗнч(рфРезультат) = Тип("ТаблицаЗначений") тогда 
			рфРезультат = ""; 
			КолКолонок = рфРезультат_Имитация.Колонки.Количество()-1;
			Для счетчикКолонок = 0 по КолКолонок цикл
				Колонка = рфРезультат_Имитация.Колонки[счетчикКолонок];
				рфРезультат = рфРезультат + Колонка.Имя + ?(счетчикКолонок=КолКолонок,Символы.ПС," | ");
			КонецЦикла;
			рфРезультат = Лев(рфРезультат,СтрДлина(рфРезультат)-1);
			рфРезультат = рфРезультат + Символы.ПС;
			Для каждого стр из рфРезультат_Имитация цикл
				Для счетчикКолонок = 0 по КолКолонок цикл
					Колонка = рфРезультат_Имитация.Колонки[счетчикКолонок];
					рфРезультат = рфРезультат + стр[Колонка.Имя] + ?(счетчикКолонок=КолКолонок,Символы.ПС," | ");
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры
