
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПутьКФормам = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя() + ".Форма";  
КонецПроцедуры

&НаСервере
Процедура СоздатьНачальныйУзелНаСервере()  
	Если НЕ ЗначениеЗаполнено(рфПутьЛокальныйОтСервера) ИЛИ НЕ ЗначениеЗаполнено(рфПланОбмена) тогда
		Сообщить("Не заполнено.");
		Возврат;
	КонецЕсли;
	ПланыОбмена.СоздатьНачальныйОбраз(рфПланОбмена,"File="""+рфПутьЛокальныйОтСервера+""";");
	Сообщить("Создание узла завершено.");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНачальныйУзел(Команда)
	СоздатьНачальныйУзелНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура рфПутьЛокальныйОтСервераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Показать(Новый ОписаниеОповещения("рфПутьЛокальныйОтСервераНачалоВыбораЗавершение", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура рфПутьЛокальныйОтСервераНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныеФайлы.Количество()> 0 тогда
		Возврат;	
	КонецЕсли;
	рфПутьЛокальныйОтСервера = ВыбранныеФайлы[0];
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьТип(Команда)
	СтруктураПараметров = Новый Структура("ОтобратьПоИмениМенеджера","ПланыОбмена"); 
	ОткрытьФорму(Объект.ПутьКФормам+".ФормаВыбораТипа", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)  
	
	Если СтрЗаканчиваетсяНа(ИсточникВыбора.ИмяФормы,".ФормаВыбораТипа") тогда 
		
		ИменаТипов = ВыбранноеЗначение.ИменаТипов;                
		СписокТипов = СтрСоединить(ИменаТипов, ",");                  
		Если ВыбранноеЗначение.Количество()=0 тогда
			Возврат;
		КонецЕсли;                                     
		//ТипЗнч(ПредопределенноеЗначение("ПланОбмена.ПланОбмена1.ПустаяСсылка"))  
		//Тип("ПланОбменаСсылка.ПланОбмена3")  
		Элементы.рфПланОбмена.ОграничениеТипа = Новый ОписаниеТипов(СписокТипов);
		//Элементы.рфПланОбмена
		//Элементы.рфПараметры.ТекущиеДанные.Тип = Новый ОписаниеТипов(СписокТипов);
		//    Элементы.рфПланОбмена.СвязиПараметровВыбора
		//Если ВыбранноеЗначение.ЭтоНуженСписокЗначений тогда
		//	Элементы.рфПараметры.ТекущиеДанные.Значение = Новый СписокЗначений;
		//	Элементы.рфПараметры.ТекущиеДанные.Значение.ТипЗначения	= Новый ОписаниеТипов(СписокТипов); 
		//Иначе
		//	Элементы.рфПараметры.ТекущиеДанные.Значение = Элементы.рфПараметры.ТекущиеДанные.Тип.ПривестиЗначение();
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   
