
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничитьМетод(Элементы.рфЗапросыМетод);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ИдентификаторСтроки = Элементы.рфЗапросы.ТекущаяСтрока;
	Если ИдентификаторСтроки = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Строка = рфЗапросы.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка = Неопределено тогда
		ВызватьИсключение "Невозможная ошибка 2023_11_26_13_00";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Строка.АдресСервера, Строка.Порт);

	Запрос = Новый HTTPЗапрос(Строка.АдресРесурса);
	 
	
	Если Строка.Метод = "GET" тогда
		Ответ = Соединение.Получить(Запрос);		
	ИначеЕсли Строка.Метод = "POST" тогда
		Запрос.УстановитьТелоИзСтроки(Строка.ТелоЗапроса); 
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);		
	Иначе
		ВызватьИсключение "2023_11_27_22_33";	
	КонецЕсли;
	
	Строка.КодОтвета = Ответ.КодСостояния;
	Строка.ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОграничитьМетод(Элемент)
	
    Элемент.РежимВыбораИзСписка = Истина;
	Элемент.СписокВыбора.Добавить("GET");
	Элемент.СписокВыбора.Добавить("POST");
	
КонецПроцедуры

#КонецОбласти

