
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ОбновитьСписокФорм();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФорм()
	
	рфФормыДляОткрытия.Очистить();  
	
	ФормыДляОткрытия = ПолучитьИзВременногоХранилища(Параметры.рфДопДанныеДляСохранения_АдресВХ);
	Для каждого стрСохрДанные из ФормыДляОткрытия цикл
		Стр = рфФормыДляОткрытия.Добавить();
		Стр.ИмяФормыДляОткрытия = стрСохрДанные.ИмяФормыДляОткрытия;  
		Стр.Ключ = стрСохрДанные.Ключ;   
		Стр.Открывать = Истина;
	КонецЦикла;                                            
	
	Для каждого ОкноКлиентскогоПриложения из ПолучитьОкна() цикл  
		Если ОкноКлиентскогоПриложения.Основное ИЛИ ОкноКлиентскогоПриложения.НачальнаяСтраница тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Содержимое из ОкноКлиентскогоПриложения.Содержимое цикл
			
			Если СтрНачинаетсяС(Содержимое.ИмяФормы, ЭтаФорма.ИмяФормы) тогда
				Продолжить;
			КонецЕсли;
			
			ИмяФормыДляОткрытия = Содержимое.ИмяФормы;
			Ключ = Неопределено;  
			Содержимое.Параметры.Свойство("Ключ", Ключ);
			
			УжеЕсть = Ложь;
			Для каждого стр из рфФормыДляОткрытия цикл
				Если стр.ИмяФормыДляОткрытия = ИмяФормыДляОткрытия И Ключ = Стр.Ключ тогда
					УжеЕсть = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если УжеЕсть тогда
				Продолжить;
			КонецЕсли;
			
			Стр = рфФормыДляОткрытия.Добавить();
			Стр.ИмяФормыДляОткрытия = Содержимое.ИмяФормы;  
			Стр.Ключ = Ключ;
			
		КонецЦикла;
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	ЭлементыДляУдаления = Новый Массив;
	Для каждого стр из рфФормыДляОткрытия цикл  
		Если стр.Открывать тогда   
			Продолжить;
		КонецЕсли;    
		ЭлементыДляУдаления.Добавить(Стр);	
	КонецЦикла;                           
	
	Для каждого стр из ЭлементыДляУдаления цикл 
		рфФормыДляОткрытия.Удалить(стр);            
	КонецЦикла;
	
	Массив = Новый Массив;
	Для каждого стр из рфФормыДляОткрытия цикл
		КлючСтр = Стр.Ключ;
		//КлючСтр = "";
		//Если Стр.Ключ <> Неопределено тогда
		//	Запись = Новый ЗаписьXML;
		//	Запись.УстановитьСтроку();
		//	СериализаторXDTO.ЗаписатьXML(Запись, стр.Ключ, НазначениеТипаXML.Явное); 
		//	КлючСтр = Запись.Закрыть();	
		//КонецЕсли;
		Массив.Добавить(Новый Структура("ИмяФормыДляОткрытия,Ключ", стр.ИмяФормыДляОткрытия, КлючСтр));	
	КонецЦикла; 
	
	//Запись = Новый ЗаписьXML;
	//Запись.УстановитьСтроку();
	////СериализаторXDTO.
	//ЗаписатьXML(Запись, Массив, НазначениеТипаXML.Явное);        
	//
	//КлючСтр = Запись.Закрыть();	

	ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	ЭтаФорма.ОповеститьОВыборе(Массив);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда) 
	
	ОбновитьСписокФорм();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ПустаяСтрока(Параметры.рфДопДанныеДляСохранения_АдресВХ) тогда
		Параметры.рфДопДанныеДляСохранения_АдресВХ = ПоместитьВоВременноеХранилище(Новый Массив,ЭтаФорма.УникальныйИдентификатор);		
	КонецЕсли;
	
КонецПроцедуры
