
&НаСервере
Процедура ОбновитьНаСервере()
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	//ФонЗад = ФоновыеЗадания.ПолучитьФоновыеЗадания();   
	//рфРегламет
	//Для каждого РегЗадание из РегЗадания цикл
	//	
	//Использование
	//Наименование 
	//Метаданные.Имя
	//Метаданные.ИмяМетода
	//Метаданные.Ключ
	//Метаданные.ПолноеИмя()
	//Параметры
	//ПоследнееЗадание
	//Расписание
	//Предопределенное
	//УникальныйИдентификатор
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
